package test;

/**
 * 字符串含""测试
 * 结论：含有
 */
public class StringTest {



    public static void main(String[] args) {
//        String str = "";
//        String[] t = str.split("\\|");
//        for(int i=0;i<t.length;i++){
//        System.out.println(t[i]);}
//        System.out.println(t.length);
//        char c = 74;
//        char[] chars = {'我','是'};
//        String str = new String(chars);
//        String str2 = new String();
//
//        System.out.println(str);
//        System.out.println(c);

//        String str = new String("数据挖 掘流 程分为 五步：定 义问 题、数据 准备 、数据 挖掘 、结 果分析 及 知识的 应用 。 1. 定 义问 题 清晰地 定义 出业务 问题， 确 定其 内涵和 外延， 确定数 据挖掘 的目的。 2. 数 据准 备 数据准 备包 括三个 阶段： A 、选择（获取）数据 --在城市档案、城市基础支撑信息、城市预案管 理库等 大型 数据库 和数据仓 库目 标中提 取数据挖 掘的 目标数 据集。数据 也可 来源于 城市 体征信 息有选择 的采 集并数 字化后的 信息 库。途径 主要有 以下 两 种方式 ： （ 1）、消息 机制 被动 接收 ：消息 中间 件技术适用 于需 要可靠 的数据传 送 的分布 式环 境。采 用消息中 间件 机制，系 统中 不同的 子系统 之间通过 传递消 息来激 活对 方的事 件，完成 相应 的操作 。发送者 将消 息发送 给消息服 务器， 消 息服 务器 将消 息存 放在 若干 队列 中， 在 合适 的时 候再 将消 息转 发给接收 者。消 息中间 件能 在不同 子系统 间通信 ，它 能屏 蔽掉 各种 子平台及协 议之间 的特性 ，实现 各模 块之间的 协同 工作，并 且在任 何时 刻都可 以 将消息 进行传 送或者 存储 转发 。 （ 2）、数据 库连 接中 间件主 动获 取：数据 库访问 中间 件技术 实现了平 台 应用程 序与 各子系 统模块之 间同 构或异 构数据源 的数 据交换 。简单的 说，利 用数据 访问 中间件 技术，平 台客 户端发 出数据查 询指 令，经 过中间件 处理， 发送至 中间 件服务 器，服务 器完 成数 据查 询，再 经中 间件 ，将 数据送 回平 台 客户端 。 B、数据预处理 -- 进行数据再加工，包 括检 查数 据的 完整性及数据的一 致性、 删除 无效数 据、填补 遗漏 的数据 等。 C、数据 的标准 化转换 将数据 标准 化转换（设计） 成一个分 析模 型。这个 分析模 型是 针对挖 掘 算 法建 立的 。建 立一个真 正适 合挖 掘算 法 的分 析模 型是 数据 挖掘 成功的关 键。在 数据 转换 时对 数据加 以标 准化 ，包 括定义 数据 的时空 属性、定 性定 量 属性、 接口 协议及 不同数据 间的 转换规 则等等。 通过 关联分 析，序列 模式、 预言、聚集 以及 异常 检测等 技术 手段 ，将 数据进 行分 类汇总 ，通过分 类树 的形式进 行梳 理展现 。分类汇 总总 体分为 两步： 第一步 ，建 立一个 模型，描 述预 定数据 类集和概 念集 ； 假定每 个元 组属于 一个预定 义的 类，由 一个类标 号属 性确定 ； 基 本概 念 训练数 据集 ：由为 建立模型 而被 分析的 数据元组 形成 ； 训练样 本： 训练数 据集中的 单个 样本（ 元组）； 学习模 型可 以用分 类规则、 判定 树或数 学公式的 形式 提供； 第二步 ，使用 模型 ，对将来 的或 未知的 对象进行 分类，评估 模型的预 测准确 率； 对每个 测试 样本， 将已知的 类标 号和该 样本的学 习模 型类预 测比较； 模型在 给定 测试集上的准确 率是正确被 模型分类 的测 试样本 的百分比； 在所有 的数 据分类 汇总整理 完毕，可 以通 过扩展 字段 增加前（ 后）缀标 识的方 式加 以数据 标准化标 识。 3. 数据挖 掘 根据数 据功 能的类 型和和数 据的 特点选 择相应的 算法，在 标准 化和转 换 过的数据集上进行 数据挖掘 。 4. 结 果分 析 对数据 挖掘 的结果 进行解释 和评 价，转换 成为能够最 终被用 户 理解的 知 识。 5. 知 识的 运用 将分析 所得 到的知 识集成到 业务 信息系 统的组织 结构 中去，在 城市管 理 服务中 加以 实际的 应用。 整 个数 据挖 掘的过程又被称为知识发现 的过 程（ 在人 工智能 领域 ）。这 里所说 的知 识发现 ，不是要 求发 现放之 四海而皆 准的 真理 ，实 际上，所有 发 现的知 识都 是相对 的，是有 特定 前提 和约 束条件 ，面 向特 定领 域的，同时 还 要能够 易于 被用户 理解。");
//        String newStr = str.replace(" ", "");
//        System.out.println(newStr);
        double i = .343;
        System.out.println(i);
        int j = 10;
        long f = j;
        System.out.println(f);
        System.out.println('a'+7+"hell0");
    }


}
